<template>
  <div class="container">
    <div id="books-container" class="sub-container">
      <!-- Контент не показывается во время загрузки --> 
        <div
        id="books"
        v-for="(books, index) in booksArray"
        v-bind:index="index"
        v-bind:key="books.index"
      >
        <!-- При использовании v-for на компонентах обязательно указывать key и явно использовать входные параметры -->
        <div class="tableCell paddingLeft">
          <!-- Левая ячейка с текстом -->
          <h3 class="paddingBooks">{{books.status}}</h3>
          <br />
          <!-- Статус книги -->
          <h3 class="paddingBooks">{{books.title}}</h3>
          <br />
          <!-- Заголовок -->
          <pre v-html="books.body" class="paddingBooks"></pre>
          <!-- Текст. Тег pre используется для переноса html-синтаксиса из json -->
        </div>
        <div class="tableCell" style="text-align: center">
          <!-- Правая ячейка с картинкой -->
          <img id="imgDesktop" v-bind:src="books.img_desktop" />
          <img id="imgMobile" v-bind:src="books.img_mobile" />
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  head: {
    title: "Книги",
    meta: [],
  },

  data: function() {
    return {
      booksArray: [
        {
          "id": 4,
          "status": null,
          "title": "Стюарт Хоум. Штурмуя культуру. Утопический самиздат от леттризма до Class War",
          "body": "Панорама радикального искусства и политических утопий после Второй мировой войны. Леттристы и ситуационисты, FLUXUS и mail art, йиппи и мазафакеры, неоизм и Class War. Автор – 25-летний Стюарт Хоум, который позже напишет «Манифест неоизма», «Отсос» и «69 мест, где надо побывать с мертвой принцессой».<br><p class='text-center'><a href='../texts/Штурмуя культуру. Утопический самиздат от леттризма до Class War.pdf' target='_blank'>pdf</a></p>",
          "img_desktop": "../images/houm.png",
          "img_mobile": "../images/mobile/houm.png"
        },
        {  "id": 6,
          "status": null,
          "title": "Гулаг расходящихся тропок. Семь текстов о будущем российского современного искусства",
          "body":  "Это сборник статей о будущем российского современного искусства, написанных видными художниками и теоретиками. Мария Алёхина – лицо Pussy Riot, главного российского арт-бренда. Борис Гройс – философ и искусствовед, хорошо известный как в России, так и на Западе. Петр Павленский – акционист и арестант двух стран. Павел Пепперштейн – культовый художник и писатель. Алексей Плуцер-Сарно – идеолог «Войны» и автор «Словаря русского мата». Авдей Тер-Оганьян – первый в РФ художник-политэмигрант. Сергей Шнуров – создатель одной из самых популярных поп-групп и начинающий арт-деятель. Между этими авторами мало общего. Они по-разному видят прошлое, настоящее и будущее российского современного искусства. Но их тексты объединяет одно: мысли о судьбе России в преддверии нового президентского срока Владимира Путина.<br><p class='text-center'><a href='../texts/Алехина, Гройс, Павленский, Пепперштейн, Плуцер-Сарно, Тер-Оганьян, Шнуров - Гулаг расходящихся тропок.pdf' target='_blank'>pdf</a> | <a href='../texts/Алехина, Гройс, Павленский, Пепперштейн, Плуцер-Сарно, Тер-Оганьян, Шнуров - Гулаг расходящихся тропок.fb2' target='_blank'>fb2</a></p>",
          "img_desktop": "../images/grt.png",
          "img_mobile": "../images/mobile/grt.png"
        },
        {
          "id": 5,
          "status": "(в печати)",
          "title": "Антология facebook-срачей о современной культуре: сделать позор еще более позорным, расшаривая его",
          "body": "В ожидании очередной неминуемой оттепели виднейшие умы России спорят о высоком уже не на диссидентских кухнях, курилках и конференциях, но в комментах на Facebook. Горячие баталии касаются не столько судеб России, свободы слова и озёрной гэбни, сколько распила грантов, грызни за бюджеты и домогательств к телу и социальному статусу. Некоторые треды уже удалены, но они увековечены в нашем издании. Его героями стали ваши фб-френды.",
          "img_desktop": "../images/antology.png",
          "img_mobile": "../images/mobile/antology.png"
        },
        {
          "id": 3,
          "status": "(в планах)",
          "title": "Роджер Файнс. Олимпийские боги против анархо-капиталистов",
          "body": "В мире после Сингулярности, утверждает футуролог и религиовед Алекс Козовски, оживут все сверхъестественные существа прошлого, в частности, вновь заявят о себе боги греческого Олимпа. По гипотезе автора, основными соперниками Зевса, Посейдона и Аида в этом мире будут сторонники анархокапитализма. Причём главная причина их антагонизма кроется не в различиях, а как раз в сходстве способов управления и хозяйствования тех и других. Битва Олимпийских богов и анархокапиталистов завершается их слиянием в единую сеть трансолимпийских корпораций. Книга послужила основой для сценария совместного фильма Дэвида Линча и Квентина Тарантино (выпуск фильма запланирован на 2021 год).",
          "img_desktop": "../images/bogi.png",
          "img_mobile": "../images/mobile/bogi.png"
        }, 
        {
          "id": 2,
          "status": "(в планах)",
          "title": "Алекс Козовски. Смеющиеся собаки и ренессанс VHS",
          "body": "В своём игровом исследовании, смешивающем теорию и вымысел, автор рассматривает перспективы обретения животными разума, а также возможные последствия этого события для общества и культуры. Сценарий, на котором он останавливается подробно, — любовь собак к кинокомедиям. Оказывается, что собакам физиологически удобней обращаться с видеокассетами, чем с прочими носителями видеоинформации: принести в зубах кассету и вставить её в проигрыватель для них проще, чем использовать DVD или скачать файл. Это приводит к изменению рынка носителей и глобальному переформатированию экономики развлечений.",
          "img_desktop": "../images/dogs.png",
          "img_mobile": "../images/mobile/dogs.png"
        }, 
        {
          "id": 1,
          "status": "(в планах)",
          "title": "Юрий Одарченко. Истоки смеха. Трактат.",
          "body": "Ранее читателю был известен только пролог к трактату поэта-эмигранта Юрия Одарченко. Во французском архиве обнаружена черновая рукопись, наиболее связные отрывки из которой позволяют максимально полно реконструировать замысел автора. А именно – своеобразную теорию глоттогенеза. Сомнение обезьяны в истинности причинно-следственных связей, по которым работает инстинкт, порождает разум, который, в свою очередь, проявляется в звуке голоса. Следовательно, согласно Одарченко, речь есть позиция сомнения.",
          "img_desktop": "../images/smeh.png",
          "img_mobile": "../images/mobile/smeh.png"
        } 
      ],
    };
  },

  mounted: function() {
    this.$nextTick(function() {
      $("#logo").addClass("black");
      $(".menu").addClass("black");
      $("p#title").addClass("black_mobile");
      $("div#title_bg").addClass("black_mobile");
      $("hr.menu-hr").addClass("black_mobile");
      $("span.hamburger-inner").addClass("black_mobile");
      $("span.hamburger-inner::after").addClass("black_mobile");
      $("span.hamburger-inner::before").addClass("black_mobile");
      document.querySelector('#books-container').style.opacity = 1;
    });
  }
};
</script>

<style>
.tableCell {
  display: table-cell;
  vertical-align: middle;
}

.paddingLeft {
  padding-left: 133px;
}

@media only screen and (max-width: 1234px) {
  .paddingLeft {
    padding-left: 3px;
  }
}

#books-container {
  opacity: 0;
  transition: opacity 1.5s;
  transition-delay: .5s;
}
</style>