<template>
  <div class="container">
    <div id="news-container" class="sub-container">
      <!-- Контент не показывается во время загрузки -->
      <div
        id="news"
        class="absolute paddingNews"
        v-for="(news, index) in newsArray"
        v-bind:index="index"
        v-bind:key="news.index"
      >
        <!-- При использовании v-for на компонентах обязательно указывать key и явно использовать входные параметры -->
        <h3>{{news.title}}</h3>
        <!-- Заголовок -->
        <pre v-html="news.body"></pre>
        <!-- Текст -->
        <img v-bind:src="news.img" class="widthImg" />
        <!-- Картинка -->
        <p align="right">
          <b>{{news.date}}</b>
        </p>
        <!-- Дата -->
      </div>
    </div>
  </div>
</template>

<script>
export default {
  head: {
    title: "Новости",
    meta: []
  },
  data: function() {
    return {
      newsArray: [
        {  "id": 4,
          "title": "Штурмуя Хоума",
          "body":  "В день рождения Стюарта Хоума публикуем первый русскоязычный перевод его книги «Штурмуя культуру. Утопический самиздат от леттризма до Class War».<br><p class='text-center'><a href='../texts/Штурмуя культуру. Утопический самиздат от леттризма до Class War.pdf' target='_blank'>pdf</a>",
          "img": null,
          "date": "24.03.2020"
        },
        {  "id": 3,
          "title": "Гулаг расходящихся тропок",
          "body":  "Ровно за неделю до президентских выборов публикуем интернет-версию нашей первой книги — «Гулаг расходящихся тропок. Семь текстов о будущем российского современного искусства». \n\nК концу месяца книгу можно будет купить в книжных и интернет-магазинах. Подробнее о местах распространения сообщим позднее. \n\n«Это сборник статей о будущем российского современного искусства, написанных видными художниками и теоретиками. Мария Алёхина — лицо Pussy Riot, главного российского арт-бренда. Борис Гройс — философ и искусствовед, хорошо известный как в России, так и на Западе. Петр Павленский — акционист и арестант двух стран. Павел Пепперштейн — культовый художник и писатель. Алексей Плуцер-Сарно — идеолог «Войны» и автор «Словаря русского мата». Авдей Тер-Оганьян — первый в РФ художник-политэмигрант. Сергей Шнуров — создатель одной из самых популярных поп-групп и начинающий арт-деятель. Между этими авторами мало общего. Они по-разному видят прошлое, настоящее и будущее российского современного искусства. Но их тексты объединяет одно: мысли о судьбе России в преддверии нового президентского срока Владимира Путина».<br><p class='text-center'><a href='../texts/Алехина, Гройс, Павленский, Пепперштейн, Плуцер-Сарно, Тер-Оганьян, Шнуров - Гулаг расходящихся тропок.pdf' target='_blank'>pdf</a> | <a href='../texts/Алехина, Гройс, Павленский, Пепперштейн, Плуцер-Сарно, Тер-Оганьян, Шнуров - Гулаг расходящихся тропок.fb2' target='_blank'>fb2</a>",
          "img": null,
          "date": "11.03.2018"
        },
        {
          "id": 2,
          "title": "Кощунство любит тишину",
          "body": "Познакомились с корреспондентом журнала «Крот» и поговорили о запуске издательства — общей концепции, планах и средствах. Интервью доступно по <a href='https://t.me/breakonthrough/282'>ссылке</a>.",
          "img": null,
          "date": "8.03.2018"
        },
        {
          "id": 1,
          "title": "Запуск издательства",
          "body": "Асебия — частное издательство, запущенное 1 марта 2018 года. Цель нашей работы — обращение к несвоевременным, неуслышанным и нетрадиционно сформулированным позициям. Мы надеемся, что сегодня в России в плоскости книгоиздания ещё возможен бунт или, по меньшей мере, вызов. Поэтому наше название отсылает к тем ситуациям, в которых книга становится не только литературным, но и политическим событием. \n\nБлижайшие планы: \n\n<b>В ПЕЧАТИ</b> Гулаг расходящихся тропок. Шесть текстов о будущем российского современного искусства \n<b>АПРЕЛЬ 2018</b> Антология facebook-срачей о современной культуре: сделать позор еще более позорным, расшаривая его \n<b>МАЙ 2018</b> Стюарт Хоум. Штурмуя культуру. Утопические течения от леттризма до Class War",
          "img": null,
          "date": "1.03.2018"
        } 
      ]
    };
  },

  mounted: function() {
    this.$nextTick(function() {
      $("#logo").addClass("black");
      $(".menu").addClass("black");
      $("p#title").addClass("black_mobile");
      $("div#title_bg").addClass("black_mobile");
      $("hr.menu-hr").addClass("black_mobile");
      $("span.hamburger-inner").addClass("black_mobile");
      $("span.hamburger-inner::after").addClass("black_mobile");
      $("span.hamburger-inner::before").addClass("black_mobile");
      document.querySelector('#news-container').style.opacity = 1;
    });
  }
};
</script>

<style>
#news {
  padding: 100px 100px 0px 100px;
}

.paddingNews {
  padding: 100px;
}

.widthImg {
  width: 100%;
}

#news-container {
  opacity: 0;
  transition: opacity 1.5s;
  transition-delay: .5s;
}
</style>