<template>
  <div class="container">
    <div id="news-container" class="sub-container">
      <!-- Контент не показывается во время загрузки -->
      <div
        id="news"
        class="absolute paddingNews"
        v-for="(news, index) in newsArray"
        v-bind:index="index"
        v-bind:key="news.index"
      >
        <!-- При использовании v-for на компонентах обязательно указывать key и явно использовать входные параметры -->
        <h3>{{ news.title }}</h3>
        <!-- Заголовок -->
        <pre v-html="news.body"></pre>
        <!-- Текст -->
        <img v-bind:src="news.img" class="widthImg" />
        <!-- Картинка -->
        <p align="right">
          <b>{{ news.date }}</b>
        </p>
        <!-- Дата -->
      </div>
    </div>
  </div>
</template>

<script>
export default {
  head: {
    title: "Новости",
    meta: []
  },
  data: function() {
    return {
      newsArray: [
        {
          id: 4,
          title: "Актуальное",
          body: `1. Вышедшая во время весеннего локдауна книга Стюарта Хоума появилась во многих т.н. интеллектуальных книжных магазинах:

Москва
<a target="_blank" href="http://www.falanster.su/">Фаланстер</a>
<a target="_blank" href="http://primuzee.ru/">Циолковский</a>
<a target="_blank" href="http://wordorder.ru/">Порядок слов в Электротеатре</a>

Санкт-Петербург
<a target="_blank" href="https://www.podpisnie.ru/">Подписные издания</a>
<a target="_blank" href="https://www.vse-svobodny.com/">Все свободны</a>
<a target="_blank" href="http://wordorder.ru/">Порядок слов</a>
<a target="_blank" href="https://vk.com/frngt">Фаренгейт 451</a>

Казань
<a target="_blank" href="https://smenabookstore.ru/shop/neknigi/">Смена</a>

2. Проект «Горький» опубликовал <a target="_blank" href="https://gorky.media/reviews/delat-pozor-eshhe-bolee-pozornym-izdavaya-ego/">рецензию</a> Станислава Севрюкова на наше издание Стюарта Хоума.

3. Сам Стюарт Хоум прокомментировал наш перевод в <a target="_blank" href="https://vk.com/@moisture-intervu-so-stuartom-houmom">интервью</a> Роберту Палмеру для проекта [moisture].

4. Мы отпечатали второй тираж нашей первой книги «Гулаг расходящихся тропок». Её можно приобрести в тех же магазинах, которые указаны выше.

Прикрепляем <a target="_blank" href="https://magazines.gorky.media/nz/2019/1/reczenzii-85.html">рецензию</a> на эту книгу из журнала «Неприкосновенный запас». Автор: Валерий Отяковский.

5. В конце года мы выпускаем третью книгу — «Конституцию Метарóссии».

12 декабря на нашем сайте появится её интернет-версия, а во второй декаде месяца её можно будет приобрести в книжных магазинах.

«Мир слишком долго ждал, что что-то случится. Что люди наконец станут свободнее и сбросят с себя ярмо обезумевшей власти. Но застой оказался сильней. Что можно сделать в этих условиях? Издательство «Асебия» публикует альтернативный проект — «Конституцию Метарóссии»: мгновенное освобождение сознания россиян и их становление метарусскими. Конституция понимается здесь не как свод правил, а как пористое устройство (мета)территории, а сам текст — как путешествие по воздушным траекториям анархистского мышления. Пришла пора вообразить настоящие поправки к этом миру!

Человек — существует. Время — временит. Бог — любит. Россия — окружает. Метароссия — прорастает».`,
          img: null,
          date: "20.11.2020"
        },
        {
          id: 4,
          title: "Штурмуя Хоума",
          body:
            "В день рождения Стюарта Хоума публикуем первый русскоязычный перевод его книги «Штурмуя культуру. Утопический самиздат от леттризма до Class War».<br><p class='text-center'><a href='../texts/Штурмуя культуру. Утопический самиздат от леттризма до Class War.pdf' target='_blank'>pdf</a>",
          img: null,
          date: "24.03.2020"
        },
        {
          id: 3,
          title: "Гулаг расходящихся тропок",
          body:
            "Ровно за неделю до президентских выборов публикуем интернет-версию нашей первой книги — «Гулаг расходящихся тропок. Семь текстов о будущем российского современного искусства». \n\nК концу месяца книгу можно будет купить в книжных и интернет-магазинах. Подробнее о местах распространения сообщим позднее. \n\n«Это сборник статей о будущем российского современного искусства, написанных видными художниками и теоретиками. Мария Алёхина — лицо Pussy Riot, главного российского арт-бренда. Борис Гройс — философ и искусствовед, хорошо известный как в России, так и на Западе. Петр Павленский — акционист и арестант двух стран. Павел Пепперштейн — культовый художник и писатель. Алексей Плуцер-Сарно — идеолог «Войны» и автор «Словаря русского мата». Авдей Тер-Оганьян — первый в РФ художник-политэмигрант. Сергей Шнуров — создатель одной из самых популярных поп-групп и начинающий арт-деятель. Между этими авторами мало общего. Они по-разному видят прошлое, настоящее и будущее российского современного искусства. Но их тексты объединяет одно: мысли о судьбе России в преддверии нового президентского срока Владимира Путина».<br><p class='text-center'><a href='../texts/Алехина, Гройс, Павленский, Пепперштейн, Плуцер-Сарно, Тер-Оганьян, Шнуров - Гулаг расходящихся тропок.pdf' target='_blank'>pdf</a> | <a href='../texts/Алехина, Гройс, Павленский, Пепперштейн, Плуцер-Сарно, Тер-Оганьян, Шнуров - Гулаг расходящихся тропок.fb2' target='_blank'>fb2</a>",
          img: null,
          date: "11.03.2018"
        },
        {
          id: 2,
          title: "Кощунство любит тишину",
          body:
            "Познакомились с корреспондентом журнала «Крот» и поговорили о запуске издательства — общей концепции, планах и средствах. Интервью доступно по <a href='https://t.me/breakonthrough/282'>ссылке</a>.",
          img: null,
          date: "8.03.2018"
        },
        {
          id: 1,
          title: "Запуск издательства",
          body:
            "Асебия — частное издательство, запущенное 1 марта 2018 года. Цель нашей работы — обращение к несвоевременным, неуслышанным и нетрадиционно сформулированным позициям. Мы надеемся, что сегодня в России в плоскости книгоиздания ещё возможен бунт или, по меньшей мере, вызов. Поэтому наше название отсылает к тем ситуациям, в которых книга становится не только литературным, но и политическим событием. ",
          img: null,
          date: "1.03.2018"
        }
      ]
    };
  },

  mounted: function() {
    this.$nextTick(function() {
      $("#logo").addClass("black");
      $(".menu").addClass("black");
      $("p#title").addClass("black_mobile");
      $("div#title_bg").addClass("black_mobile");
      $("hr.menu-hr").addClass("black_mobile");
      $("span.hamburger-inner").addClass("black_mobile");
      $("span.hamburger-inner::after").addClass("black_mobile");
      $("span.hamburger-inner::before").addClass("black_mobile");
      main = 0;
      document.querySelector("#news-container").style.opacity = 1;
    });
  }
};
</script>

<style>
#news {
  padding: 100px 100px 0px 100px;
}

.paddingNews {
  padding: 100px;
}

.widthImg {
  width: 100%;
}

#news-container {
  opacity: 0;
  transition: opacity 1.5s;
  transition-delay: 0.5s;
}
</style>
